---
kind: property
id: P:Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPattern
source: html/3e2c025a-2e4d-1aac-c8d4-2bfbe0fc2e1f.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPattern Property

The property labeled "Relief Pattern" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public static string MasonryCMUPattern { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".